{
    "code": "de",
    "navbar-contact": "Kontakt",
    "navbar-home": "Über mich",
    "navbar-portfolio": "Projekte",
    "navbar-skills": "Fähigkeiten",

    "about-name":"Adam Szabo",
    "about-title":"Junior Frontend-Entwickler",

    "flag-language":"Sprache",
    "flag-theme":"Thema",

    "home-name": "Hallo, mein name ist Adam Szabo",
    "home-junior": " und ich bin ein Junior Frontend-Developer",
    "home-about": "Die Welt der Programmierung hat mich schon immer angezogen. Für meine berufliche Weiterentwicklung habe ich nicht nur autodidaktisch gelernt, sondern auch ein Bootcamp absolviert. Seitdem habe ich die Bereiche gefunden, die für mich besonders spannend und herausfordernd erscheinen: Frontend- und Mobile-Anwendungsentwicklung. Ich liebe neue Technologien und bin immer offen für neue Möglichkeiten, die mir weiteres Wachstum ermöglichen.",
    "home-cv": "Lebenslauf",
    "home-portfolio": "Meine Arbeiten",

    "portfolio-fullstackBlog":"ich habe den Node.js API Project: Build a Blog Project API 2023-Kurs auf Udemy abgeschlossen. Ich erweitere ihn kontinuierlich um zusätzliche Funktionen und arbeite auch am Frontend. Derzeit umfassen die Funktionen die Registrierung, Anmeldung, das Schreiben und Bearbeiten von Beiträgen, das Liken von Beiträgen sowie das Schreiben und Bearbeiten von Kommentaren. Benutzer können das Profil des Autors anzeigen, wo sie den Benutzer mögen oder blockieren können, und der Autor kann sehen, wer sein Profil angesehen hat. Benutzer können auch ihr eigenes Profil überprüfen, um zu verfolgen, wen sie mögen oder blockiert haben. Es gibt einen Änderungsreiter, auf dem Benutzer ihr Profilbild, den Vornamen, den Nachnamen und das Passwort ändern können. Es gibt die Möglichkeit, das Benutzerprofil zu löschen. Es steht eine Admin-Schnittstelle zur Verfügung, auf der alle Benutzer angezeigt und vom Administrator blockiert werden können. In diesem Fall kann der blockierte Benutzer keine Beiträge erstellen.Ein blockierter Benutzer kann eine Nachricht an den Administrator senden. Außerdem wurde ein Dunkelmodus hinzugefügt. Videodemonstration verfügbar.",
    "portfolio-memorygame": "Dies ist ein einfaches Memory-Spiel. Es wählt zufällig sechs von 18 Bildern für das Spiel aus.",
    "portfolio-quiz": "Dies ist ein Quiz-Spiel mit der Verwendung der opentdb API. Am Ende der Fragen werden die richtigen und falschen Antworten angezeigt.",
    "portfolio-movie":"Filme/Serien können mit Hilfe der OMDB-API gesucht werden. Sie können zu Favoriten hinzugefügt werden. Weitere Informationen werden in einem Modal-Fenster angezeigt.",
    "portfolio-angularTodo": "Dies ist eine Angular-basierte TODO-Liste, für die ich PrimeNG verwendet habe.",
    "portfolio-angularPokemon": "Dies ist eine Pokémon-Anwendung, die 20 Pokémon auflistet. Sie können nach ihren Typen filtern und durch ein Popup-Fenster weitere Informationen zu einem bestimmten Pokémon anzeigen.",
    "portfolio-nativeCrypto":"Eine Android-Krypto-App mit einem Begrüßungsbildschirm, einer Kryptoseite, die APIs verwendet. Benutzer können Favoriten hinzufügen und dabei AsyncStorage nutzen. Zusätzlich gibt es eine Seite, auf der mehr Informationen über Kryptowährungen gelesen werden können. ",
    "portfolio-nativeMovie":"Diese App verwendet die OMDb-API, um Film- und Seriendaten abzurufen. Sie können Filme und Serien manuell durchsuchen oder die Suchfunktion verwenden. Sie können Elemente auch zu Ihrer Favoritenliste hinzufügen. Wenn Sie Benachrichtigungen zulassen, erhalten Sie lokale Benachrichtigungen. Bei Serien können Sie alle Staffeln sehen und Details zu einzelnen Episoden anzeigen.",
    "portfolio-flutterPokemon":"Meine erste Flutter-Anwendung, die die PokeAPI verwendet. Sie ruft alle Pokémon ab, zeigt jedes in einer Kartenansicht an und navigiert zu einem Detailbildschirm, auf dem mehr Informationen über das Pokémon angezeigt werden. Benutzer können Pokémon zu Favoriten hinzufügen, und es gibt eine dynamische Suchfunktion.",
    
    "portfolio-memorygame-name":"Memory Game(react)",
    "portfolio-quiz-name":"Quiz(react)",
    "portfolio-movie-name":"Film(react)",
    "portfolio-angularTodo-name":"Todo list(angular)",
    "portfolio-angularPokemon-name":"Pokemon(angular)",
    "portfolio-nativeCrypto-name":"Crypto(react native)",
    "portfolio-flutterPokemon-name": "Pokemon",


    "portfolio-title": "Sieh dir meine Arbeiten an.",
    "skills-title": "Diese Technologien beherrsche ich.",
   
    "loading-loading": "Laden",
    
    "modal-close":"Schließen"
   
}