{
  "code": "en",
  "navbar-contact": "Contact",
  "navbar-home": "About",
  "navbar-portfolio": "Projects",
  "navbar-skills": "Skills",

  "about-name": "Adam Szabo",
  "about-title": "Junior Frontend Developer",

  "flag-language": "Language",
  "flag-theme": "Theme",

  "home-name": "Hello, my name is Adam Szabo",
  "home-junior": "and I am a Junior FrontEnd developer",
  "home-about": "The world of programming has always fascinated me. For my professional development, I have not only learned self-taught, but also completed a bootcamp. Since then, I have found the areas that seem particularly exciting and challenging to me: Frontend and mobile application development. I love new technologies and am always open to new opportunities that allow me to grow further.",
  "home-cv": "Resume",
  "home-portfolio": "Projects",
  "portfolio-title": "Check out my works.",

  "portfolio-fullstackBlog": "I have completed the Node.js API Project: Build a Blog Project API 2023 course on Udemy. I am continuously enhancing it with additional features and also working on the frontend. Currently, the functionalities include registration, login, writing and editing posts, liking posts, writing and editing comments. Users can view the author's profile, where they can like or block the user, and the author can see who has viewed their profile. Users can also check their own profile to track who they have liked or blocked. There is a modification tab where users can change their profile picture, first name, last name, and password. There is an option to delete the user profile. An admin interface is available to view all users and can be used by the administrator to block users. In this case, the blocked user won't be able to create posts. Blocked user can send a message to the administrator. Additionally, a dark mode has been added. Video demonstration available.",
  "portfolio-memorygame": "This is a simple memory game. It randomly selects six out of eighteen images for the game.",
  "portfolio-quiz": "This is a Quiz game using opentdb api. At the end of the questions, it displays the correct and incorrect answers.",
  "portfolio-movie": "Movies/TV shows can be searched using the OMDB API. They can be saved to favorites. More information is displayed in a modal window.",
  "portfolio-angularTodo": "This is an Angular-based TODO-List for which I used PrimeNG.",
  "portfolio-angularPokemon": "This is a pokemon application, it lists 20 pokemons, you can filter them separately by type, and with the help of a pop-up window, it displays even more data about the given pokemon.",
  "portfolio-nativeMovie": "This app uses the OMDb API to fetch movie and series data. You can browse movies and series manually or use the search function. You can also add items to your favorites list, and if you allow notifications, you will receive local notifications. For series, you can see all seasons and view details for each episode.",
  "portfolio-flutterPokemon": "My first Flutter application that uses the PokeAPI. It fetches all Pokémon, displays each in a card format, and navigates to a details screen where more information about the Pokémon is shown. Users can add Pokémon to favorites, and there's a dynamic search feature.",
  "portfolio-flutterWeather": "It starts with a starting screen where you can enter the name of a city. If a valid city name is found during the request, it displays the daily and hourly weather. If nothing is entered, an error is shown and it won't allow you to proceed. If an invalid name is entered, an error message is displayed. A modal window is included if you want to request weather data for another city. The weather icons and background images adapt to the weather conditions. It uses the OpenMeteo api.",
  "portfolio-webshop": "Webshop application built with React + Vite and TypeScript. Tailwind CSS was used for styling. The foundation is the open-source API, FakeStoreAPI. useReducer was used for managing all request states. The website consists of four pages. On the main page, products are displayed in card format. You can add items to favorites, place them in the cart, and filter by category. Additionally, you can navigate to a details page, where more information about the product is available. In the cart, products are displayed individually, allowing you to increase, decrease, or remove the quantity. At checkout, you can enter the DISCOUNT10 promo code to receive a 10% discount.",
  "portfolio-flutterCelestical": "This app, built with Flutter, is a celestial body application. It consists of a main screen and a details page. The primary goal was to practice animations.",
  "portfolio-tetris": "Tetris game where shapes appear in random colors and can be rotated. If a row is filled, it is cleared, and the player earns points. If the player loses, a Game Over message appears along with the score and an option to restart.",

  "portfolio-memorygame-name": "Memory Game",
  "portfolio-quiz-name": "Quiz",
  "portfolio-movie-name": "Movie",
  "portfolio-angularTodo-name": "Todo list",
  "portfolio-angularPokemon-name": "Pokemon",
  "portfolio-flutterPokemon-name": "Pokemon",
  "portfolio-flutterWeather-name": "Weather",
  "portfolio-nativeMovie-name": "Movie",
  "portfolio-webshop-name": "Webshop",
  "portfolio-flutterCelestical-name": "Celestial bodies",
  "portfolio-tetris-name": "Tetris-game",

  "skills-title": "I know these technologies.",

  "loading-loading": "Loading",

  "modal-close": "Close"
}
